----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Linear-1          [-1, 3, 128, 256]          33,024
           Dropout-2          [-1, 3, 128, 256]               0
              ReLU-3          [-1, 3, 128, 256]               0
            Linear-4          [-1, 3, 128, 512]         131,584
           Dropout-5          [-1, 3, 128, 512]               0
              ReLU-6          [-1, 3, 128, 512]               0
            Linear-7         [-1, 3, 128, 1024]         525,312
           Dropout-8         [-1, 3, 128, 1024]               0
              ReLU-9         [-1, 3, 128, 1024]               0
           Linear-10         [-1, 3, 128, 2048]       2,099,200
          Dropout-11         [-1, 3, 128, 2048]               0
             ReLU-12         [-1, 3, 128, 2048]               0
           Linear-13         [-1, 3, 128, 4096]       8,392,704
          Dropout-14         [-1, 3, 128, 4096]               0
             ReLU-15         [-1, 3, 128, 4096]               0
           Linear-16         [-1, 3, 128, 6120]      25,073,640
          Dropout-17         [-1, 3, 128, 6120]               0
             ReLU-18         [-1, 3, 128, 6120]               0
           Linear-19         [-1, 3, 128, 3072]      18,803,712
          Dropout-20         [-1, 3, 128, 3072]               0
             ReLU-21         [-1, 3, 128, 3072]               0
           Linear-22         [-1, 3, 128, 2048]       6,293,504
          Dropout-23         [-1, 3, 128, 2048]               0
             ReLU-24         [-1, 3, 128, 2048]               0
           Linear-25         [-1, 3, 128, 1024]       2,098,176
          Dropout-26         [-1, 3, 128, 1024]               0
             ReLU-27         [-1, 3, 128, 1024]               0
           Linear-28          [-1, 3, 128, 512]         524,800
          Dropout-29          [-1, 3, 128, 512]               0
             ReLU-30          [-1, 3, 128, 512]               0
           Linear-31          [-1, 3, 128, 256]         131,328
          Dropout-32          [-1, 3, 128, 256]               0
             ReLU-33          [-1, 3, 128, 256]               0
           Linear-34          [-1, 3, 128, 128]          32,896
          Dropout-35          [-1, 3, 128, 128]               0
             ReLU-36          [-1, 3, 128, 128]               0
           Linear-37           [-1, 3, 128, 64]           8,256
          Dropout-38           [-1, 3, 128, 64]               0
             ReLU-39           [-1, 3, 128, 64]               0
           Linear-40           [-1, 3, 128, 32]           2,080
          Dropout-41           [-1, 3, 128, 32]               0
             ReLU-42           [-1, 3, 128, 32]               0
           Linear-43           [-1, 3, 128, 16]             528
          Dropout-44           [-1, 3, 128, 16]               0
             ReLU-45           [-1, 3, 128, 16]               0
           Linear-46            [-1, 3, 128, 8]             136
          Dropout-47            [-1, 3, 128, 8]               0
             ReLU-48            [-1, 3, 128, 8]               0
          Flatten-49                 [-1, 3072]               0
           Linear-50                  [-1, 384]       1,180,032
          Dropout-51                  [-1, 384]               0
             ReLU-52                  [-1, 384]               0
           Linear-53                   [-1, 48]          18,480
          Dropout-54                   [-1, 48]               0
             ReLU-55                   [-1, 48]               0
           Linear-56                   [-1, 11]             539
================================================================
Total params: 65,349,931
Trainable params: 65,349,931
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.19
Forward/backward pass size (MB): 186.50
Params size (MB): 249.29
Estimated Total Size (MB): 435.98
----------------------------------------------------------------