----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 16, 128, 128]             448
       BatchNorm2d-2         [-1, 16, 128, 128]              32
              ReLU-3         [-1, 16, 128, 128]               0
            Conv2d-4         [-1, 16, 128, 128]           2,320
       BatchNorm2d-5         [-1, 16, 128, 128]              32
              ReLU-6         [-1, 16, 128, 128]               0
         MaxPool2d-7           [-1, 16, 64, 64]               0
            Conv2d-8           [-1, 32, 64, 64]           4,640
       BatchNorm2d-9           [-1, 32, 64, 64]              64
             ReLU-10           [-1, 32, 64, 64]               0
           Conv2d-11           [-1, 32, 64, 64]           9,248
      BatchNorm2d-12           [-1, 32, 64, 64]              64
             ReLU-13           [-1, 32, 64, 64]               0
        MaxPool2d-14           [-1, 32, 32, 32]               0
           Conv2d-15           [-1, 64, 32, 32]          18,496
      BatchNorm2d-16           [-1, 64, 32, 32]             128
             ReLU-17           [-1, 64, 32, 32]               0
           Conv2d-18           [-1, 64, 32, 32]          36,928
      BatchNorm2d-19           [-1, 64, 32, 32]             128
             ReLU-20           [-1, 64, 32, 32]               0
        MaxPool2d-21           [-1, 64, 16, 16]               0
           Linear-22                 [-1, 4096]      67,112,960
          Dropout-23                 [-1, 4096]               0
             ReLU-24                 [-1, 4096]               0
           Linear-25                 [-1, 4096]      16,781,312
          Dropout-26                 [-1, 4096]               0
             ReLU-27                 [-1, 4096]               0
           Linear-28                 [-1, 1000]       4,097,000
          Dropout-29                 [-1, 1000]               0
             ReLU-30                 [-1, 1000]               0
           Linear-31                   [-1, 11]          11,011
================================================================
Total params: 88,074,811
Trainable params: 88,074,811
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.19
Forward/backward pass size (MB): 22.09
Params size (MB): 335.98
Estimated Total Size (MB): 358.25
----------------------------------------------------------------
